Groupby

In [2]:
import pandas as pd

In [4]:
var = pd.DataFrame({"Name":["a","b","c","d","a","b","a","b","a","c","c","d"],
                    "s_1":[12,13,14,12,13,14,15,23,25,16,10,34],
                    "s_2":[23,24,25,26,27,28,29,20,25,34,35,36]})
var

   Name  s_1  s_2
0     a   12   23
1     b   13   24
2     c   14   25
3     d   12   26
4     a   13   27
5     b   14   28
6     a   15   29
7     b   23   20
8     a   25   25
9     c   16   34
10    c   10   35
11    d   34   36

In [5]:
var_new = var.groupby("Name")
var_new

In [7]:
for x,y in var_new:
    print(x)
    print(y)
    print()

a
  Name  s_1  s_2
0    a   12   23
4    a   13   27
6    a   15   29
8    a   25   25

b
  Name  s_1  s_2
1    b   13   24
5    b   14   28
7    b   23   20

c
   Name  s_1  s_2
2     c   14   25
9     c   16   34
10    c   10   35

d
   Name  s_1  s_2
3     d   12   26
11    d   34   36

In [8]:
var_new.get_group("a")

  Name  s_1  s_2
0    a   12   23
4    a   13   27
6    a   15   29
8    a   25   25

In [9]:
var_new.min()

      s_1  s_2
Name
a      12   23
b      13   20
c      10   25
d      12   26

In [11]:
var_new.max()
var_new.mean()

            s_1        s_2
Name
a     16.250000  26.000000
b     16.666667  24.000000
c     13.333333  31.333333
d     23.000000  31.000000

In [12]:
l1 = list(var_new)
l1

[('a',
    Name  s_1  s_2
  0    a   12   23
  4    a   13   27
  6    a   15   29
  8    a   25   25),
 ('b',
    Name  s_1  s_2
  1    b   13   24
  5    b   14   28
  7    b   23   20),
 ('c',
     Name  s_1  s_2
  2     c   14   25
  9     c   16   34
  10    c   10   35),
 ('d',
     Name  s_1  s_2
  3     d   12   26
  11    d   34   36)]